# 3장 레디스 기본 개념

## 레디스의 자료 구조

### string

- `string`에는 최대 512MB의 문자열을 저장할 수 있다.
- 모든 종류의 문자열을 binary-safe하게 처리할 수 있다.
    - 이미지 같은 바이트 값, HTTP 응답 등 다양한 데이터를 저장 가능
- `string`은 키와 값이 일대일로 연결되는 유일한 자료 구조
- `SET` 커맨드로 `string` 데이터를 저장하고 `GET`으로 조회한다.

```bash
> SET hello world
ok

> GET hello
"world"
```

- 기존에 값이 있었다면 기존 값은 새 값으로 대체된다.
- `NX` 옵션을 통해 키가 없을 때만 새 키를 저장하도록 할 수 있다.
- 반대로 `XX` 옵션으로 키가 있을 때만 덮어 쓰기를 하고 새로운 키는 생성하지 않도록 할 수 있다.

```bash
> SET hello newal NX
(nil)

> SET hello newal XX
ok

> GET hello
"newal"
```

- `string` 자료구조는 숫자 형태 데이터도 저장할 수 있다.
- `INCR`, `INCRBY` 키워드로 숫자를 원자적으로 조작할 수 있다.
    - 원자적이라는 것은 여러 클라이언트가 경쟁 상태를 발생시킬 일이 없음을 의미

```bash
> SET counter 100
ok

> INCR counter
(integer) 101

> INCRBY counter 50
(integer) 151
```

- `MSET`, `MGET` 커맨드로 여러 키를 한 번에 조작 가능하다.
    - 성능이 중요한 대규모 시스템에서 적절히 사용한다면 네트워크 통신을 줄여 서비스 응답 속도를 전반적으로 올릴 수 있다.

```bash
> MSET a 10 b 20 c 30
ok

> MGET a b c
1) "10"
2) "20"
3) "30"
```

### list

- `list`는 순서를 가지는 문자열의 목록이다
  - 인덱스를 이용해 접근 가능
  - 일반적으로 스택과 큐로 사용됨
- 하나의 `list`에는 최대 42억여 개의 아이템을 저장할 수 있다.
- 기본적인 커맨드
  - `LPUSH` - 왼쪽에 데이터를 추가
  - `RPUSH` - 오른쪽에 데이터 추가
  - `LRANGE` - list의 데이터를 조회
  - `LPOP` - 첫 번째 아이템을 삭제하며 반환한다.
  - `LTRIM` - 시작과 끝 아이템 인덱스를 인자로 전달 받아 범위에 속하지 않은 아이템은 모두 삭제
    - `LPUSH`와 함께 적절히 사용하면 고정된 길이의 큐를 쉽게 유지할 수 있다.
      - `LPUSH` 후 `LTRIM`
    - 데이터를 일단 쌓고 주기적인 배치 처리로 삭제하는 것 보다 이러한 방식이 훨씬 효율적이다.
      - 매번 큐의 마지막만 삭제하므로 O(1)
  - `LINSERT` - 원하는 데이터 앞이나 뒤에 데이터를 추가
    - `BEFORE`, `AFTER` 옵션을 통해 앞, 뒤 중 선택할 수 있다.
  - `LSET` - 저장한 인덱스 데이터를 신규 값으로 덮어쓸 수 있다.
  - `LINDEX` - 원하는 인덱스의 데이터를 확인 가능

### Hash

- `hash`는 필드-값 쌍을 가진 아이템의 집합이다.
- 필드는 하나의 `hash` 내에서 유일하며 필드와 값 모두 문자열로 저장된다.
- `hash`는 객체를 표현하기 적절한 자료구조이기에 DB 테이블 데이터로 변환하는 것도 간단하다.
- 각 아이템마다 다른 필드를 가질 수 있고 동적으로 다양한 필드를 추가할 수 있다.
- 관계형 데이터베이스를 쓰는 것보다 더 유연한 개발이 가능하다.
- `HSET` 커맨드로 hash에 아이템을 저장할 수 있다.

```bash
> HSET Product:123 Name "Happy Hacking"
(integer) 1

> HSET Product:123 TypeID 35
(integer) 1

> HSET Product:123 Version 2002
(integer) 1

> HSET Product:234 Name "Track Ball" TypeID 32
(integer) 2
```

- `HGET` 커맨드로 데이터를 가져올 수 있는데 키와 아이템 필드를 함께 입력해야 한다.

```bash
> HGET Product:123 TypeID
"35"

> HGET Product:234 Name, TypeID
1) "Track Ball"
2) "32"
```

- `HGETALL` 커맨드로 모든 필드-값 쌍을 차례로 반환한다.

```bash
> HGETALL Product:234
1) "Name"
2) "Track Ball"
3) "TypeID"
4) "32"
```

### sorted set

- `sorted set`은 스코어(`score`) 값에 따라 정렬되는 고유한 문자열 집합이다.
  - 모든 아이템은 스코어-값 쌍을 가진다.
- `list`처럼 인덱스를 이용해 각 아이템에 접근 가능하다.
  - 인덱스로 아이템에 접근할 일이 많다면 `list` 보다 `sorted set`을 사용하는 것이 효율적이다.
  - 인덱스로 데이터에 접근하는 것은 `list`는 O(n), `sorted set`은 O(log(n))으로 처리된다.
- `ZADD` 커맨드로 `sorted set`에 아이템을 저장할 수 있다.
  - 스코어-값 쌍으로 입력
  - 데이터가 이미 있으면 스코어만 업데이트되며 재정렬된다.

```bash
> ZADD score:220817 100 user:B
(integer) 1

> ZADD score:220817 150 user:A 150 user:C 200 userF 300 user:E
(integer) 4
```

- `ZADD` 커맨드엔 다양한 옵션이 있다.
  - `XX`: 아이템이 이미 존재할 때만 스코어를 업데이트
  - `NX`: 아이템이 존재하지 않을 때만 신규 삽입, 기존 아이템 스코어를 업데이트하지 않음
  - `LT`: 업데이트하려는 스코어가 기존 스코어보다 작을 때만 업데이트. 존재하지 않을 땐 신규 삽입
  - `GT`: 업데이트하려는 스코어가 기존 스코어보다 클 때만 업데이트. 존재하지 않을 땐 신규 삽입
- `ZRANGE` 커맨드로 `sorted set`의 데이터를 조회할 수 있다.
  - `start`와 `stop` 범위를 항상 입력해야 한다.

```bash
> ZRANGE key start stop [BYSCORE | BYLEX] [REV] [LIMIT offset count]
[WITHSCORES]
```

- `sorted set`은 여러 옵션을 통해 다양한 조건으로 데이터를 검색 가능하다.

### sorted set - 인덱스로 데이터 조회

- `ZRANGE` 커맨드는 기본적으로 인덱스 기반 조회
  - `start`, `stop` 인자에 인덱스를 전달
- `WITHSCORE` 옵션으로 스코어와 함께 출력할 수 있다.
- `REV` 옵션으로 역순 출력할 수 있다.

```bash
> ZRANGE score:220817 1 3 WITHSCORES
1) "user:A"
2) "150"
3) "user:C"
4) "150"
5) "user:F"
6) "200"
```

- `list`처럼 음수 인덱스를 사용 가능하다.
  - `ZRANGE <key> 0, -1` 커맨드는 모든 데이터를 조회한다

### 스코어로 데이터 조회

- `ZRANGE` 커맨드에 `BYSCORE` 옵션으로 스코어로 데이터를 조회 가능하다

```bash
> ZRANGE score:220817 100 150 BYSCORE WITHSCORES
1) "user:A"
2) "100"
3) "user:C"
4) "150"
5) "user:F"
6) "150"

# 스코어에 ( 문자를 추가하면 해당 스코어를 포함하지 않는다.
> ZRANGE score:220817 (100 150 BYSCORE WITHSCORES
1) "user:C"
2) "150"
3) "user:F"
4) "150"
```

### 사전 순으로 데이터 조회

- `sorted set`은 스코어가 같으면 사전 순으로 정렬된다.
- 스코어가 같을 때 `BYLEX` 옵션으로 사전 순서를 이용해 특정 아이템을 조회할 수 있다.
  - `start`, `stop`에 사전 순 비교를 위한 문자열을 전달
  - 입력한 문자열을 포함하려면 `(`, 포함하지 않을 때 `[` 문자 사용

```bash
> ZRANGE mySortedSet (b (f BYLEX
banana
candy
dream
egg
```

### 비트맵

- 비트맵(Bitmap)은 `string` 자료 구조에 bit 연산을 수행할 수 있도록 확장한 형태다.
- 비트맵 사용의 가장 큰 장점은 저장 공간을 획기적으로 줄일 수 있다.
  - ex) 몇십억 유저에 대한 y/n 데이터는 512MB 안에 충분히 저장 가능
- `SETBIT`와 `GETBIT` 커맨드로 비트맵을 다룰 수 있다.

```bash
> SETBIT mybitmap 2 1
(integer) 1

> GETBIT mybitmap 2
(integer) 1
```

- `BITCOUNT` 커맨드로 1로 설정된 비트 수를 카운팅할 수 있다.

```bash
> BITCOUNT mybitmap
(integer) 4)
```

### Hyperloglog

- `hyperloglog`는 집합의 원소 개수인 카디널리티를 추정할 수 있는 자료 구조다.
  - 대량 데이터에서 고유 값을 집계할 때 유용
- `hyperloglog`는 저장되는 데이터 수에 구애받지 않고 유일한 원소 개수를 계산할 수 있다.
  - 중복을 피하려고 저장된 데이터를 모두 기억하여 메모리가 늘어나는 `set`과 달리 일정한 메모리를 유지한다.
- 하나의 `hyperloglog`에 최대 12KB 크기를 가지며 최대 2^64개 아이템을 저장할 수 있다.
- `PFADD` 커맨드로 아이템을 저장하고, `PFCOUNT`로 카디널리티를 추정할 수 있다.

```bash
> PFADD members 123
(integer) 1

> PFADD members 500
(integer) 1

> PFADD members 12
(integer) 1

> PFCOUNT members
(integer) 3
```

### Geospatial

- `Geospatial` 자료 구조는 경도, 위도 데이터 쌍으로 지리 데이터를 저장하는 방법이다.
  - 내부적으로 `sorted set`으로 저장
  - 키를 중복으로 저장되지 않는다.
- `GEOADD <key> 경도 위도 member` 순으로 저장

```bash
> GEOADD travel 14.2353452534 50.235234123 prague
(integer) 1
```

- `GEOPOS` 커맨드로 저장된 위치 데이터를 조회 가능

```bash
> GEOPOS travel prague
1) 1) "14.2353452534"
   2) "50.235234123"
```

### stream

- `stream`은 레디스를 메시지 브로커로서 사용할 수 있게 하는 자료 구조다.
- `stream`은 append-only 방식으로 데이터를 저장
- 실시간 이벤트 혹은 로그성 데이터 저장을 위해 사용 가능하다.
